//種別
const typeList = [
    {i:0,t:"普通"},
    {i:1,t:"区準"},
    {i:2,t:"準急"},
    {i:3,t:"通準"},
    {i:4,t:"快速"},
    {i:5,t:"通急"},
    {i:6,t:"急行"},
    {i:7,t:"快急"},
    {i:8,t:"F快急"},
    {i:9,t:"特急"},
    {i:10,t:"S-TRAIN"},
    {i:11,t:"回送"},
    {i:12,t:"臨時"},
    {i:13,t:"----"}
];
const getTypeI = function(name){
    for(const obj of typeList){
        if(obj.t === name){
            return obj.i;
        }
    }
    return getTypeI("----");
}

//行き先
destinationList = [
    ["池袋",	""],
    ["小竹向原",	""],
    ["練馬",	""],
    ["豊島園",	""],
    ["石神井公園",	""],
    ["保谷",	""],
    ["ひばりヶ丘",	""],
    ["清瀬",	""],
    ["所沢",	""],
    ["西所沢",	""],
    ["西武新宿",	""],
    ["本川越",	""],
    ["西武球場前",	""],
    ["小手指",	""],
    ["狭山ヶ丘",	""],
    ["入間市",	""],
    ["仏子",	""],
    ["飯能",	""],
    ["高麗",	""],
    ["西吾野",	""],
    ["横瀬",	""],
    ["西武秩父",	""],
    ["三峰口",	""],
    ["長瀞 三峰口",	""],
    ["豊洲",	""],
    ["新木場",	""],
    ["渋谷",	""],
    ["武蔵小杉",	""],
    ["元住吉", ""],
    ["菊名",	""],
    ["横浜",	""],
    ["元町・中華街",	""],
    ["府中本町",	""],
    ["東所沢",	""],
    ["南越谷",	""],
    ["西船橋",	""],
    ["大宮",	""],
    ["八王子",	""],
    ["東京",	""],
    ["南船橋",	""],
    ["新習志野",	""],
    ["海浜幕張",	""],
    ["当駅止まり",	""],
    ["通過(Passing)",	""],
    ["通過(Passing)(旧)",	""],
    ["通過(Non-Stop)",	""],
    ["降車専用",	""],
    ["----",	""]
];

//両数
carCountList = [
    ["4両",	""],
    ["7両",	""],
    ["8両",	""],
    ["10両",	""],
    ["----",	""]
];

//ドア数
doorCountList = [
    ["2ドア",	""],
    ["4ドア",	""],
    ["全席指定",	""],
    ["----",	""]
];

//のりば
platformList = [
    ["1", ""],
    ["2", ""],
    ["3", ""],
    ["4", ""],
    ["5", ""],
    ["6", ""],
    ["7", ""],
    ["特", ""],
    ["→", ""],
    ["←", ""],
    ["", ""]
];

